Конфигурация/InformationRegisters/ДоступныеСчетаДоверительногоУправления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ДоступныеСчетаДоверительногоУправления</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Catalogs/ГруппыПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ГруппыПользователей</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пользователи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НазначенныеРоли</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Роль</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступныеВидыДоговоровИСчетаДоверительногоУправления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыДоговоровДоверительногоУправления</v8:Type>
								<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/InformationRegisters/ДоступныеСчетаДоверительногоУправления/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Добавляет в регистр данные о доступности счетов ДУ по переданному объекту.
//
// Параметры:
//  Организация	- Организация, в рамках которой устанавливатся доступность.
//  Объект		- группа пользователей или счет ДУ, по которому нужно установить доступность.
Функция ДобавитьДанныеОДоступностиСчетовДоверительногоУправления(Организация, Объект) Экспорт
	
	Результат = Истина;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация",	Организация);
	Запрос.УстановитьПараметр("Объект",			Объект);
	
	Запрос.Текст =
	#Область ТекстЗапроса
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаДоверительногоУправления.Ссылка КАК СчетДУ,
		|	СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления КАК ВидДоговора
		|ПОМЕСТИТЬ _СчетаДУОрганизации
		|ИЗ
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|ГДЕ
		|	СчетаДоверительногоУправления.Организация = &Организация
		|	И (ТИПЗНАЧЕНИЯ(&Объект) = ТИП(Справочник.ГруппыПользователей)
		|			ИЛИ ТИПЗНАЧЕНИЯ(&Объект) = ТИП(Справочник.СчетаДоверительногоУправления)
		|				И СчетаДоверительногоУправления.Ссылка = &Объект)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ГруппыПользователей.Ссылка КАК ГруппаПользователей
		|ПОМЕСТИТЬ _ГруппыПользователей
		|ИЗ
		|	Справочник.ГруппыПользователей КАК ГруппыПользователей
		|ГДЕ
		|	ГруппыПользователей.Организация = &Организация
		|	И НЕ ГруппыПользователей.ПометкаУдаления
		|	И (ТИПЗНАЧЕНИЯ(&Объект) = ТИП(Справочник.СчетаДоверительногоУправления)
		|			ИЛИ ТИПЗНАЧЕНИЯ(&Объект) = ТИП(Справочник.ГруппыПользователей)
		|				И ГруппыПользователей.Ссылка = &Объект)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ГруппыПользователейСостав.Ссылка КАК Группа,
		|	ГруппыПользователейСостав.Пользователь КАК Пользователь
		|ПОМЕСТИТЬ _СоставыГрупп
		|ИЗ
		|	Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
		|ГДЕ
		|	ГруппыПользователейСостав.Ссылка В
		|			(ВЫБРАТЬ
		|				_ГруппыПользователей.ГруппаПользователей КАК ГруппаПользователей
		|			ИЗ
		|				_ГруппыПользователей КАК _ГруппыПользователей)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ГруппыПользователейДоступныеВидыДоговоровИСчетаДоверительногоУправления.Ссылка КАК Группа,
		|	ГруппыПользователейДоступныеВидыДоговоровИСчетаДоверительногоУправления.Объект КАК Объект
		|ПОМЕСТИТЬ _НастройкиГрупп
		|ИЗ
		|	Справочник.ГруппыПользователей.ДоступныеВидыДоговоровИСчетаДоверительногоУправления КАК ГруппыПользователейДоступныеВидыДоговоровИСчетаДоверительногоУправления
		|ГДЕ
		|	ГруппыПользователейДоступныеВидыДоговоровИСчетаДоверительногоУправления.Ссылка В
		|			(ВЫБРАТЬ
		|				_ГруппыПользователей.ГруппаПользователей КАК ГруппаПользователей
		|			ИЗ
		|				_ГруппыПользователей КАК _ГруппыПользователей)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	&Организация КАК Организация,
		|	_СоставыГрупп.Пользователь КАК Пользователь,
		|	_СчетаДУОрганизации.СчетДУ КАК СчетДоверительногоУправления
		|ИЗ
		|	_СоставыГрупп КАК _СоставыГрупп
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _НастройкиГрупп КАК _НастройкиГрупп
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ _СчетаДУОрганизации КАК _СчетаДУОрганизации
		|			ПО (ВЫБОР
		|					КОГДА ТИПЗНАЧЕНИЯ(_НастройкиГрупп.Объект) = ТИП(Перечисление.ВидыДоговоровДоверительногоУправления)
		|						ТОГДА _НастройкиГрупп.Объект = _СчетаДУОрганизации.ВидДоговора
		|					ИНАЧЕ _НастройкиГрупп.Объект = _СчетаДУОрганизации.СчетДУ
		|				КОНЕЦ)
		|		ПО _СоставыГрупп.Группа = _НастройкиГрупп.Группа";
	#КонецОбласти
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	НачатьТранзакцию();
	
	Пока Выборка.Следующий() Цикл
		РезультатЗаписи = ИзменитьДоступностьСчетаДоверительногоУправления(Выборка.Организация, Выборка.Пользователь, Выборка.СчетДоверительногоУправления, "Добавить");
		
		Если НЕ РезультатЗаписи.Успешно Тогда
			ТекстСообщения = СтрШаблон("Не удалось установить доступность счетов доверительного управления из-за ошибки! %1", РезультатЗаписи.ОписаниеОшибки);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Результат = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Результат Тогда
		ЗафиксироватьТранзакцию();
	Иначе
		ОтменитьТранзакцию();
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции

// Удаляет из регистра данные о доступности счета ДУ, переданному в параметрах, или по организации в целом.
//
// Параметры:
//  Организация						- организация, в рамках которой удаляется доступность.
//  СчетДоверительногоУправления	- счет ДУ, доступность которого необходимо отключить. Если параметр = Неопределено, из регистра удаляются все данные по организации.
Функция УдалитьДанныеОДоступностиСчетовДоверительногоУправления(Организация, СчетДоверительногоУправления = Неопределено) Экспорт
	
	Результат = Истина;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Организация",					Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления",	СчетДоверительногоУправления);
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДоступныеСчетаДоверительногоУправления.Организация КАК Организация,
		|	ДоступныеСчетаДоверительногоУправления.Пользователь КАК Пользователь,
		|	ДоступныеСчетаДоверительногоУправления.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ИЗ
		|	РегистрСведений.ДоступныеСчетаДоверительногоУправления КАК ДоступныеСчетаДоверительногоУправления
		|ГДЕ
		|	ДоступныеСчетаДоверительногоУправления.Организация = &Организация
		|	И (&СчетДоверительногоУправления = НЕОПРЕДЕЛЕНО
		|			ИЛИ ДоступныеСчетаДоверительногоУправления.СчетДоверительногоУправления = &СчетДоверительногоУправления)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	НачатьТранзакцию();
	
	Блокировка = Новый БлокировкаДанных;
	
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ДоступныеСчетаДоверительногоУправления");
	
	Если СчетДоверительногоУправления = Неопределено Тогда
		ЭлементБлокировки.УстановитьЗначение("Организация", Организация);
	Иначе
		ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Организация",					"Организация");
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("СчетДоверительногоУправления",	"СчетДоверительногоУправления");
	КонецЕсли;
	
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
	Блокировка.Заблокировать();
	
	// Для ускорения работы удаления: если счет ДУ не задан, удаляются данные по организации в целом,
	// поэтому не нужно удалять записи в отдельности, чистим весь набор по организации.
	// если же задан, то там считанные единицы записей, соотвественно, запись пройдет быстро.
	
	// Очистка набора по организации.
	Если СчетДоверительногоУправления = Неопределено Тогда
		
		НаборЗаписей = РегистрыСведений.ДоступныеСчетаДоверительногоУправления.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Организация.Установить(Организация);
		
		Попытка
			НаборЗаписей.Записать();
		Исключение
			ТекстСообщения = СтрШаблон("Не удалось отключить доступность счетов доверительного управления из-за ошибки! %1", ОписаниеОшибки());
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Результат = Ложь;
		КонецПопытки;
		
	// Удаление нескольких записей.	
	Иначе
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			РезультатУдаления = ИзменитьДоступностьСчетаДоверительногоУправления(Выборка.Организация, Выборка.Пользователь, Выборка.СчетДоверительногоУправления, "Удалить");
			
			Если НЕ РезультатУдаления.Успешно Тогда
				ТекстСообщения = СтрШаблон("Не удалось отключить доступность счетов доверительного управления из-за ошибки! %1", РезультатУдаления.ОписаниеОшибки);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Результат = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Если Результат Тогда
		ЗафиксироватьТранзакцию();
	Иначе
		ОтменитьТранзакцию();
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции

// Производит полный пересчет доступности счетов доверительного управления,
// исходя из составов и настроек существующих, непомеченных на удаление, групп пользователей организации, переданной в параметрах.
//
// Параметры:
//  Организация	- организация, для которой обновляется доступность счетов ДУ.
Функция ОбновитьДанныеОДоступностиСчетовДоверительногоУправленияПоОрганизации(Организация) Экспорт
	
	Результат = Истина;
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Определяем новый набор записей по оргнизации.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.Текст =
	#Область ТекстЗапроса
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаДоверительногоУправления.Ссылка КАК СчетДУ,
		|	СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления КАК ВидДоговора
		|ПОМЕСТИТЬ _СчетаДУПоОрганизации
		|ИЗ
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|ГДЕ
		|	СчетаДоверительногоУправления.Организация = &Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ГруппыПользователей.Ссылка КАК ГруппаПользователей
		|ПОМЕСТИТЬ _ГруппыПользователей
		|ИЗ
		|	Справочник.ГруппыПользователей КАК ГруппыПользователей
		|ГДЕ
		|	ГруппыПользователей.Организация = &Организация
		|	И НЕ ГруппыПользователей.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ГруппыПользователейСостав.Ссылка КАК Группа,
		|	ГруппыПользователейСостав.Пользователь КАК Пользователь
		|ПОМЕСТИТЬ _СоставыГруппПользователей
		|ИЗ
		|	Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
		|ГДЕ
		|	ГруппыПользователейСостав.Ссылка В
		|			(ВЫБРАТЬ
		|				_ГруппыПользователей.ГруппаПользователей КАК ГруппаПользователей
		|			ИЗ
		|				_ГруппыПользователей КАК _ГруппыПользователей)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ГруппыПользователейДоступныеВидыДоговоровИСчетаДоверительногоУправления.Ссылка КАК Группа,
		|	ГруппыПользователейДоступныеВидыДоговоровИСчетаДоверительногоУправления.Объект КАК Объект
		|ПОМЕСТИТЬ _НастройкиГруппПользователей
		|ИЗ
		|	Справочник.ГруппыПользователей.ДоступныеВидыДоговоровИСчетаДоверительногоУправления КАК ГруппыПользователейДоступныеВидыДоговоровИСчетаДоверительногоУправления
		|ГДЕ
		|	ГруппыПользователейДоступныеВидыДоговоровИСчетаДоверительногоУправления.Ссылка В
		|			(ВЫБРАТЬ
		|				_ГруппыПользователей.ГруппаПользователей КАК ГруппаПользователей
		|			ИЗ
		|				_ГруппыПользователей КАК _ГруппыПользователей)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	&Организация КАК Организация,
		|	_СоставыГруппПользователей.Пользователь КАК Пользователь,
		|	_СчетаДУПоОрганизации.СчетДУ КАК СчетДоверительногоУправления
		|ИЗ
		|	_СоставыГруппПользователей КАК _СоставыГруппПользователей
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _НастройкиГруппПользователей КАК _НастройкиГруппПользователей
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ _СчетаДУПоОрганизации КАК _СчетаДУПоОрганизации
		|			ПО (ТИПЗНАЧЕНИЯ(_НастройкиГруппПользователей.Объект) = ТИП(Перечисление.ВидыДоговоровДоверительногоУправления)
		|						И _НастройкиГруппПользователей.Объект = _СчетаДУПоОрганизации.ВидДоговора
		|					ИЛИ ТИПЗНАЧЕНИЯ(_НастройкиГруппПользователей.Объект) = ТИП(Справочник.СчетаДоверительногоУправления)
		|						И _НастройкиГруппПользователей.Объект = _СчетаДУПоОрганизации.СчетДУ)
		|		ПО _СоставыГруппПользователей.Группа = _НастройкиГруппПользователей.Группа";
	#КонецОбласти
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	НаборЗаписей = РегистрыСведений.ДоступныеСчетаДоверительногоУправления.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Организация.Установить(Организация);
	
	Пока Выборка.Следующий() Цикл
		НоваяЗапись									= НаборЗаписей.Добавить();
		НоваяЗапись.Организация						= Выборка.Организация;
		НоваяЗапись.Пользователь					= Выборка.Пользователь;
		НоваяЗапись.СчетДоверительногоУправления	= Выборка.СчетДоверительногоУправления;
	КонецЦикла;
	
	НачатьТранзакцию();
	
	// Блокируем все данные регистра по организации.
	Блокировка = Новый БлокировкаДанных;
	
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ДоступныеСчетаДоверительногоУправления");
	ЭлементБлокировки.УстановитьЗначение("Организация", Организация);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
	Блокировка.Заблокировать();
	
	// Записываем весь набор записей.
	Попытка
		НаборЗаписей.Записать();
	Исключение
		ТекстСообщения = СтрШаблон("Не удалось обновить доступность счетов доверительного управления по организации %1 из-за ошибки! %2", Организация, ОписаниеОшибки());
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Результат = Ложь;
	КонецПопытки;
	
	Если Результат Тогда
		ЗафиксироватьТранзакцию();
	Иначе
		ОтменитьТранзакцию();
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// В зависимости от необходимого действия меняет доступность счета доверительного управления.
//
// Параметры:
//  Организация						- организация, в рамках которой меняется доступность.
//  Пользователь					- пользователь, для которого меняется доступность.
//  СчетДоверительногоУправления	- счет доверительного управления, доступность которого меняется.
//  Действие						- действие (строка "Добавить" или "Удалить"), определяющее вид изменения доступности.
Функция ИзменитьДоступностьСчетаДоверительногоУправления(Организация, Пользователь, СчетДоверительногоУправления, Действие)
	
	Результат = Новый Структура;
	
	Если Действие = "Добавить" ИЛИ Действие = "Удалить" Тогда
		
		Результат.Вставить("Успешно",			Истина);
		Результат.Вставить("ОписаниеОшибки",	Неопределено);
		
		МенеджерЗаписи = РегистрыСведений.ДоступныеСчетаДоверительногоУправления.СоздатьМенеджерЗаписи();
		
		МенеджерЗаписи.Организация					= Организация;
		МенеджерЗаписи.Пользователь					= Пользователь;
		МенеджерЗаписи.СчетДоверительногоУправления	= СчетДоверительногоУправления;
		
		МенеджерЗаписи.Прочитать();
		
		// Добавляем / удаляем запись только при ее наличии.
		Если Действие = "Добавить" Тогда
			
			// Добавляем запись только при ее отсутствии.
			Если НЕ МенеджерЗаписи.Выбран() Тогда
				
				МенеджерЗаписи.Организация					= Организация;
				МенеджерЗаписи.Пользователь					= Пользователь;
				МенеджерЗаписи.СчетДоверительногоУправления	= СчетДоверительногоУправления;
				
				Попытка
					МенеджерЗаписи.Записать();
				Исключение
					Результат.ОписаниеОшибки	= ОписаниеОшибки();
					Результат.Успешно			= Ложь;
				КонецПопытки;
				
			КонецЕсли;
			
		ИначеЕсли Действие = "Удалить" Тогда
			
			// Удаляем запись только при ее наличии.
			Если МенеджерЗаписи.Выбран() Тогда
				
				Попытка
					МенеджерЗаписи.Удалить();
				Исключение
					Результат.ОписаниеОшибки	= ОписаниеОшибки();
					Результат.Успешно			= Ложь;
				КонецПопытки;
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		Результат.Вставить("Успешно",			Ложь);
		Результат.Вставить("ОписаниеОшибки",	СтрШаблон("Действие '%1' не определено или не поддерживается для изменения доступности счета доверительного управления!", Действие));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
